backend-api/app/Controllers/AnggotaController.php

SELECT *
FROM `anggota`
---
    public function index()
    {
        $db = db_connect();

        $data = $db->table('anggota')
                   ->get()
                   ->getResult();

INSERT INTO `anggota` (`nama`, `email`, `telepon`, `alamat`) VALUES ('valen', 'valenramzi8@gmail.com', '081400360134', 'KP.SRENGSENG \nRT/RW:004/005\nDES.SUKAMULYA\nKEC.SUKATANI')
---
    public function create()
    {
        $json = $this->request->getJSON();

        $data = [
            'nama'     => $json->nama,
            'email'    => $json->email,
            'telepon'  => $json->telepon,
            'alamat'   => $json->alamat
        ];

        $db = db_connect();

        $db->table('anggota')->insert($data);