backend-api/app/Controllers/BukuController.php

SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`
FROM `buku`
JOIN `kategori` ON `kategori`.`id_kategori`=`buku`.`kategori_id`
JOIN `penulis` ON `penulis`.`id_penulis`=`buku`.`penulis_id`
JOIN `penerbit` ON `penerbit`.`id_penerbit`=`buku`.`penerbit_id`
---
    public function index()
    {
        $db = db_connect();

        $builder = $db->table('buku');

        $builder->select('
            buku.*,
            kategori.nama_kategori,
            penulis.nama_penulis,
            penerbit.nama_penerbit
        ');

        $builder->join(
            'kategori',
            'kategori.id_kategori=buku.kategori_id'
        );

        $builder->join(
            'penulis',
            'penulis.id_penulis=buku.penulis_id'
        );

        $builder->join(
            'penerbit',
            'penerbit.id_penerbit=buku.penerbit_id'
        );

        return $this->respond(
            $builder->get()->getResult()
        );

INSERT INTO `buku` (`judul`, `kategori_id`, `penulis_id`, `penerbit_id`, `tahun_terbit`, `stok`) VALUES ('pemrograman we', '3', '1', '3', '2006', '1')
---
    public function create()
    {
        $json = $this->request->getJSON();

        (new BukuModel())->insert([
            'judul'=>$json->judul,
            'kategori_id'=>$json->kategori_id,
            'penulis_id'=>$json->penulis_id,
            'penerbit_id'=>$json->penerbit_id,
            'tahun_terbit'=>$json->tahun_terbit,
            'stok'=>$json->stok
        ]);