backend-api/app/Controllers/KategoriController.php

    public function index()
    {
        return $this->respond(
            (new KategoriModel())->findAll()
        );
---
SELECT *
FROM `kategori`

    public function create()
    {
        $model = new KategoriModel();

        $model->insert([
            'nama_kategori' =>
            $this->request->getJSON()->nama_kategori
        ]);
---
INSERT INTO `kategori` (`nama_kategori`) VALUES ('pengertahuan')