backend-api/app/Controllers/PeminjamanController.php

    public function index()
    {
        $db = db_connect();

        $builder = $db->table('peminjaman');

        $builder->select('
            peminjaman.*,
            anggota.nama as nama_anggota,
            buku.judul as judul_buku
        ');

        $builder->join(
            'anggota',
            'anggota.id_anggota = peminjaman.anggota_id'
        );

        $builder->join(
            'buku',
            'buku.id_buku = peminjaman.buku_id'
        );

        return $this->respond(
            $builder->get()->getResult()
        );
---
SELECT `peminjaman`.*, `anggota`.`nama` as `nama_anggota`, `buku`.`judul` as `judul_buku`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`anggota_id`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`buku_id`

    public function create()
    {
        $data = [
            'anggota_id' => $this->request->getJSON()->anggota_id,
            'buku_id' => $this->request->getJSON()->buku_id,
            'tanggal_pinjam' => $this->request->getJSON()->tanggal_pinjam,
            'tanggal_kembali' => $this->request->getJSON()->tanggal_kembali,
            'status' => $this->request->getJSON()->status
        ];

        $db = db_connect();

        $db->table('peminjaman')->insert($data);
---
INSERT INTO `peminjaman` (`anggota_id`, `buku_id`, `tanggal_pinjam`, `tanggal_kembali`, `status`) VALUES ('1', '3', '2026-06-25', '', 'Dipinjam')