backend-api/app/Controllers/PenulisController.php

    public function create()
    {
        $data = $this->request->getJSON(true);

        if (
            empty($data['nama_penulis']) ||
            empty($data['negara'])
        ) {
            return $this->fail([
                'message' => 'Nama Penulis dan Negara wajib diisi'
            ]);
        }

        $this->model->insert([
            'nama_penulis' => $data['nama_penulis'],
            'negara'       => $data['negara']
        ]);
---
INSERT INTO `penulis` (`nama_penulis`, `negara`) VALUES ('muflih', 'afrika')